In [1]:
import pandas as pd

print(pd.__version__)

1.3.4

In [4]:
data = {'nama':['Didi Kempot','Glenn Fredly','Mbah Surip'],
       'tempat kelahiran' : ['Surakarta, Jawa tengah','Jakarta, DKI Jakarta','Mojokerto']}

df = pd.DataFrame(data)
df

           nama        tempat kelahiran
0   Didi Kempot  Surakarta, Jawa tengah
1  Glenn Fredly    Jakarta, DKI Jakarta
2    Mbah Surip               Mojokerto

Memecahkan nama depan dan nama belakang

In [7]:
df[['nama_depan','nama_belakang']] = df['nama'].str.split(' ',expand=True)

#Split ini berdasarkan spasi
#df[[create kolom pertama , create kolom kedua]] string yang akan dipisah
#df['nama'] = dikolom nama

df

           nama        tempat kelahiran nama_depan nama_belakang
0   Didi Kempot  Surakarta, Jawa tengah       Didi        Kempot
1  Glenn Fredly    Jakarta, DKI Jakarta      Glenn        Fredly
2    Mbah Surip               Mojokerto       Mbah         Surip

In [9]:
df[['kota','provinsi']] = df['tempat kelahiran'].str.split(',',expand = True)
df

,nama,tempat kelahiran,nama_depan,nama_belakang,kota,provinsi
0,Didi Kempot,"Surakarta, Jawa tengah",Didi,Kempot,Surakarta,Jawa tengah
1,Glenn Fredly,"Jakarta, DKI Jakarta",Glenn,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,Mojokerto,Mbah,Surip,Mojokerto,None